def get_data():
    
    return f"{input('Введите фамилию: ')} {input('Введите имя: ')} {input('Введите название предмета: ')} {input('Введите оценку: ')}\n"

def get_number_operation():
    return input('Выберите номер категории\n \
        где: 1-показать все фамилии\n \
             2-показать все имена\n \
             3-показать все предметы\n \
             4-показать учеников, изучающих выбранный предмет с оценками\n \
             5-показать всю таблицу\n \
             6-показать информацию по ученику\n \
             7-добавить ученика\n \
             8-выход\n ')